label1=['BA主备服务\n器网络状态','BMS主备服务\n器网络状态']
label2=['PUE指标','电流百分比','最佳节能组合 ','不节能组合','机组长时间喘震','可能出现主机负荷不均衡',]
label3=['排气温度','油温、油压']
label4=['冷冻泵频率','冷冻泵压力','冷却泵频率','冷却泵压力','冷却回水温度','冷却塔风扇频率','冷却塔出水温度','塔盘液位']
label5=['1F末端','2F末端','3F末端','4F末端']
label6=['蒸发趋近温度','冷冻出水温度','冷冻出水设定温度','蒸发压力','主机冷冻回水温度']
label7=['主机出水温度','蓄冷罐温度']
label8=['冷冻主供\n回水管温度','冷冻主供\n回水管压力','膨胀水箱液位 ']
label9=['冷凝趋近温度','冷却出水温度','冷凝压力','冷却回水温度']
label10=['冷却主供回水\n管温差、压差']
label11=['市政压力','应急补水\n水池液位']
x=[]
labelx=[label1,label2,label3,label4,label5,label6,label7,label8,label9,label10,label11]
for i in labelx:
    x+=i
print( x)
